In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Using cached ipython_sql-0.4.0-py3-none-any.whl (19 kB)
Requirement already satisfied: six in c:\users\gerha\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython>=1.0 in c:\users\gerha\anaconda3\lib\site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\gerha\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting sqlparse
  Using cached sqlparse-0.4.1-py3-none-any.whl (42 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\gerha\anaconda3\lib\site-packages (from ipython-sql) (1.3.20)
Processing c:\users\gerha\appdata\local\pip\cache\wheels\46\60\6c\bb25d05df22906786206e901e9354bb3061061191116768bee\prettytable-0.7.2-py3-none-any.whl
Requirement already satisfied: pickleshare in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: jedi>=0.10 in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: backcall in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: decorator in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: traitlets>=4.2 in c:\users\gerha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\gerha\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\gerha\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1

In [2]:
%load_ext sql

In [3]:
%sql sqlite://

%sql sqlite:///premier.sqlite would link to the file premier.sqlite on the hard disk

In [4]:
%%sql
CREATE TABLE rep (
    rep_num CHAR(3) PRIMARY KEY,
    last_name CHAR(15),
    first_name CHAR(15),
    street CHAR(15),
    city CHAR(15),
    state CHAR(2),
    zip CHAR(5),
    commission DECIMAL(7,2),
    rate DECIMAL(3,2)
);

 * sqlite://
Done.

[]

In [5]:
%sql DROP TABLE rep;

 * sqlite://
Done.

[]

In [6]:
%%sql
CREATE TABLE rep (
    rep_num CHAR(3) PRIMARY KEY,
    last_name CHAR(15),
    first_name CHAR(15),
    street CHAR(15),
    city CHAR(15),
    state CHAR(2),
    zip CHAR(5),
    commission DECIMAL(7,2),
    rate DECIMAL(3,2)
);

 * sqlite://
Done.

[]

In [7]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[]

In [8]:
%%sql
CREATE TABLE CUSTOMER
(CUSTOMER_NUM CHAR(3) PRIMARY KEY,
CUSTOMER_NAME CHAR(35) NOT NULL,
STREET CHAR(15),
CITY CHAR(15),
STATE CHAR(2),
ZIP CHAR(5),
BALANCE DECIMAL(8,2),
CREDIT_LIMIT DECIMAL(8,2),
REP_NUM CHAR(2) );

 * sqlite://
Done.

[]

In [9]:
%sql INSERT INTO rep VALUES('20','Kaiser','Valerie','624 Randall','Grove','FL','33321',20542.50,0.05);

 * sqlite://
1 rows affected.

[]

In [10]:
%sql SELECT * FROM rep;

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 20542.5, 0.05)]

In [11]:
%sql INSERT INTO rep (rep_num, last_name, first_name) VALUES ('85','Webb','Tina');

 * sqlite://
1 rows affected.

[]

In [12]:
%sql INSERT INTO rep (rep_num, first_name, last_name) VALUES ('485','Gerhard','Trippen');

 * sqlite://
1 rows affected.

[]

In [13]:
%%sql
UPDATE rep
SET last_name = 'Perry'
WHERE rep_num = '85'

 * sqlite://
1 rows affected.

[]

In [14]:
%sql DELETE FROM rep WHERE rep_num = 85;

 * sqlite://
1 rows affected.

[]

In [15]:
%sql INSERT INTO rep VALUES('35','Hull','Richard','532 Jackson','Sheldon','FL','33553',39216.00,0.07);

 * sqlite://
1 rows affected.

[]

In [16]:
%sql INSERT INTO rep VALUES('65','Perez','Juan','1626 Taylor','Fillmore','FL','33336',23487.00,0.05)

 * sqlite://
1 rows affected.

[]

In [17]:
# extra
%sql SELECT AVG(commission), MAX(commission) FROM rep;

 * sqlite://
Done.

[(27748.5, 39216)]

extra:

In [18]:
%%sql
UPDATE rep
SET commission = 39216.00
WHERE rep_num = '35';

 * sqlite://
1 rows affected.

[]

In [19]:
# extra
%sql SELECT AVG(commission), MAX(commission) FROM rep;

 * sqlite://
Done.

[(27748.5, 39216)]

In [20]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20'),
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35'),
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65'),
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35'),
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65'),
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20'),
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65'),
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35'),
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35'),
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
10 rows affected.

[]

In [21]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3) );

 * sqlite://
Done.

[]

In [22]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148'),
('21610','20-OCT-2010','356'),
('21613','21-OCT-2010','408'),
('21614','21-OCT-2010','282'),
('21617','23-OCT-2010','608'),
('21619','23-OCT-2010','148'),
('21623','23-OCT-2010','608');

 * sqlite://
7 rows affected.

[]

In [23]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [24]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [25]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [26]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

In [27]:
%%sql
SELECT customer_num, customer_name, balance
FROM customer;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", 6550),
 ('282', 'Brookings Direct', 431.5),
 ('356', "Ferguson's", 5785),
 ('408', 'The Everything Shop', 5285.25),
 ('462', 'Bargains Galore', 3412),
 ('524', "Kline's", 12762),
 ('608', "Johnson's Department Store", 2106),
 ('687', "Lee's Sport and Appliance", 2851),
 ('725', "Deerfield's Four Seasons", 248),
 ('842', 'All Season', 8221)]

In [28]:
%sql SELECT * FROM part;

 * sqlite://
Done.

[('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390)]

In [29]:
%sql SELECT * FROM customer;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport", '2837 Greenway', 'Fillmore', 'FL', '33336', 6550, 7500, '20'),
 ('282', 'Brookings Direct', '3827 Devon', 'Grove', 'FL', '33321', 431.5, 10000, '35'),
 ('356', "Ferguson's", '382 Wildwood', 'Northfield', 'FL', '33146', 5785, 7500, '65'),
 ('408', 'The Everything Shop', '1828 Raven', 'Crystal', 'FL', '33503', 5285.25, 5000, '35'),
 ('462', 'Bargains Galore', '3829 Central', 'Grove', 'FL', '33321', 3412, 10000, '65'),
 ('524', "Kline's", '838 Ridgeland', 'Fillmore', 'FL', '33336', 12762, 15000, '20'),
 ('608', "Johnson's Department Store", '372 Oxford', 'Sheldon', 'FL', '33553', 2106, 10000, '65'),
 ('687', "Lee's Sport and Appliance", '282 Evergreen', 'Altonville', 'FL', '32543', 2851, 5000, '35'),
 ('725', "Deerfield's Four Seasons", '282 Columbia', 'Sheldon', 'FL', '33553', 248, 7500, '35'),
 ('842', 'All Season', '28 Lakeview', 'Grove', 'FL', '33321', 8221, 7500, '20')]

In [30]:
%%sql
SELECT customer_name
FROM customer
WHERE customer_num = '148';

 * sqlite://
Done.

[("Al's Appliance and Sport",)]

In [31]:
%%sql
SELECT customer_num, customer_name, balance, credit_limit
FROM customer
WHERE balance > credit_limit;

 * sqlite://
Done.

[('408', 'The Everything Shop', 5285.25, 5000),
 ('842', 'All Season', 8221, 7500)]

In [32]:
%%sql
SELECT description
FROM part
WHERE warehouse = '3'
AND on_hand > 25;

 * sqlite://
Done.

[('Iron',)]

In [33]:
%%sql
SELECT description
FROM part
WHERE warehouse = '3'
OR on_hand > 25;

 * sqlite://
Done.

[('Iron',),
 ('Home Gym',),
 ('Microwave Oven',),
 ('Cordless Drill',),
 ('Washer',),
 ('Stand Mixer',),
 ('Dishwasher',)]

In [34]:
%%sql
SELECT description
FROM part
WHERE NOT (warehouse = '3');

 * sqlite://
Done.

[('Home Gym',),
 ('Microwave Oven',),
 ('Gas Range',),
 ('Dryer',),
 ('Treadmill',)]

In [35]:
%%sql
SELECT customer_num, customer_name, balance
FROM customer
WHERE balance BETWEEN 2000 AND 5000;

 * sqlite://
Done.

[('462', 'Bargains Galore', 3412),
 ('608', "Johnson's Department Store", 2106),
 ('687', "Lee's Sport and Appliance", 2851)]

## Group Assignment 1

A.1. List the names of all customers that have a credit limit of $7,500 or less.

In [36]:
%%sql 
SELECT customer_name
FROM customer
WHERE credit_limit <= 7500;

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

A.2. List the order numbers for orders placed by customer number 608 on 10/23/2010.

In [37]:
%%sql
SELECT order_num
FROM orders
WHERE customer_num = '608'
AND order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617',), ('21623',)]

In [38]:
%sql SELECT * FROM orders;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

A.3. List the part number and part description of all parts that are in item class HW.

In [39]:
%%sql
SELECT part_num, description
FROM part
WHERE class = 'HW';

 * sqlite://
Done.

[('AT94', 'Iron'), ('DL71', 'Cordless Drill'), ('FD21', 'Stand Mixer')]

A.4. List the part number, part description, and on-hand value for each part in item class SG. (Hint: On-hand value is the result of multiplying the number of units on hand by the price.)

In [40]:
%%sql
SELECT part_num, description, on_hand * price as on_hand_value
FROM part
WHERE class = 'SG';

 * sqlite://
Done.

[('BV06', 'Home Gym', 35772.75), ('KV29', 'Treadmill', 12510)]

A.5. How many customers have a balance that exceeds their credit limit?

In [41]:
%%sql
SELECT COUNT(*)
FROM customer
WHERE balance > credit_limit;

 * sqlite://
Done.

[(2,)]

A.6. What is the part number, description, and price of the least expensive part in the database?

In [42]:
%%sql
SELECT part_num, description, price
FROM part
WHERE price = (SELECT MIN(price) FROM part);

 * sqlite://
Done.

[('AT94', 'Iron', 24.95)]

A.7. For each order, list the order number, order date, customer number, and customer name.

In [43]:
%%sql
SELECT order_num, order_date, orders.customer_num, customer_name
FROM orders, customer
WHERE orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

A.8. For each order placed on October 21, 2010, list the order number, customer number, and customer name.

In [44]:
%%sql
SELECT order_num, orders.customer_num, customer_name
FROM orders, customer
WHERE orders.customer_num = customer.customer_num
AND order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', '408', 'The Everything Shop'), ('21614', '282', 'Brookings Direct')]

A.9. For each order placed on October 21, 2010, list the order number, part number, part description, and item class for each part ordered.

In [45]:
%%sql
SELECT order_line.order_num, order_line.part_num, description, class
FROM orders, part, order_line
WHERE order_line.part_num = part.part_num
AND orders.order_num = order_line.order_num 
AND order_date = '21-OCT-2010';

 * sqlite://
Done.

[('21613', 'KL62', 'Dryer', 'AP'), ('21614', 'KT03', 'Dishwasher', 'AP')]

B.1. A customer is not necessarily represented by a single sales rep, but can be represented by several sales reps. When a customer places an order, the sales rep who gets the commission on the order must be in the collection of sales reps who represent the customer. Draw an E-R diagram for the new design.

*Primary keys in* **bold**<br>
REP (**REP_NUM**, LAST_NAME, FIRST_NAME, STREET,
	CITY, STATE, ZIP, COMMISSION, RATE)<br>
CUSTOMER (**CUSTOMER_NUM**, CUSTOMER_NAME, STREET,
	CITY, STATE, ZIP, BALANCE, CREDIT_LIMIT)<br>
CUSTOMER_REP (**CUSTOMER_NUM, REP_NUM**)<br>
ORDERS (**ORDER_NUM**, ORDER_DATE, CUSTOMER_NUM, REP_NUM)<br><br>
Students were required to write the SQL commands that create these tables. Omitted here.

Entity-Relationship diagram: <img src="ER-CR_B1.png">

B.2. There is no relationship between customers and sales reps. When a customer places an order, any sales rep can process the order. On the order, you need to identify both the customer placing the order and the sales rep responsible for the order. Draw an E-R diagram for the new design.

REP (**REP_NUM**, LAST_NAME, FIRST_NAME, STREET, CITY, STATE, ZIP,
	COMMISSION, RATE)<br>
CUSTOMER (**CUSTOMER_NUM**, CUSTOMER_NAME, STREET, CITY, STATE, 
	ZIP, BALANCE, CREDIT_LIMIT)<br>
ORDERS (**ORDER_NUM**, ORDER_DATE, CUSTOMER_NUM, REP_NUM)

Entity-Relationship diagram: <img src="ER-CR_B2.png">

B.3. Using your knowledge of Premiere Products, determine the functional dependencies that exist in the following table. After determining the functional dependencies, convert this table to an equivalent collection of tables that are in third normal form.
PART (PART_NUM, DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE, (ORDER_NUM, ORDER_DATE, CUSTOMER_NUM, CUSTOMER_NAME, NUM_ORDERED, QUOTED_PRICE) )
PART_NUM is the primary key of this table. The highlighted text indicates repeating groups, i.e., each part occurs in many orders for which we record the order number, date, customer number and so forth. State the SQL commands that create the collection of tables in 3NF.

PART_NUM -> DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE<br>
ORDER_NUM -> ORDER_DATE, CUSTOMER_NUM <br>
CUSTOMER_NUM -> CUSTOMER_NAME<br>
PART_NUM, ORDER_NUM -> NUM_ORDERED, QUOTED_PRICE<br>
<br>
	Relations:<br>
    *Primary keys in* **bold**<br> 
PART (**PART_NUM**, DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE)<br>
ORDERS (**ORDER_NUM**, ORDER_DATE, CUSTOMER_NUM) <br>
CUSTOMER (**CUSTOMER_NUM**, CUSTOMER_NAME)<br>
ORDER_LINE (**PART_NUM**, **ORDER_NUM**, NUM_ORDERED, QUOTED_PRICE) <br>

C.1. List the number and name of each customer represented by sales rep 35 or sales rep 65.

In [46]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER 
WHERE REP_NUM = '35'
OR REP_NUM = '65';

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('608', "Johnson's Department Store"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons")]

C.2. List the part number and part description of each part that is not in item class AP.

In [47]:
%%sql
SELECT PART_NUM, DESCRIPTION
FROM PART
WHERE NOT (CLASS = 'AP');

 * sqlite://
Done.

[('AT94', 'Iron'),
 ('BV06', 'Home Gym'),
 ('DL71', 'Cordless Drill'),
 ('FD21', 'Stand Mixer'),
 ('KV29', 'Treadmill')]

C.3. List the part number, description, and number of units on hand for each part that has
between 10 and 25 units on hand, including both 10 and 25. Do this in two different ways.

In [48]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART
WHERE ON_HAND >= 10
AND ON_HAND <= 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

In [49]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART
WHERE ON_HAND BETWEEN 10 AND 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

C.4. Use the IN operator to list the part number and part description of each part in item class AP or SG.

In [50]:
%%sql
SELECT PART_NUM, DESCRIPTION
FROM PART
WHERE CLASS IN ('AP', 'SG');

 * sqlite://
Done.

[('BV06', 'Home Gym'),
 ('CD52', 'Microwave Oven'),
 ('DR93', 'Gas Range'),
 ('DW11', 'Washer'),
 ('KL62', 'Dryer'),
 ('KT03', 'Dishwasher'),
 ('KV29', 'Treadmill')]

C.5. Find the number and name of each customer whose name begins with the letter B.

In [51]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE CUSTOMER_NAME LIKE 'B%';

 * sqlite://
Done.

[('282', 'Brookings Direct'), ('462', 'Bargains Galore')]

C.6. List all details about all parts. Order the output by part description.

In [52]:
%%sql
SELECT *
FROM PART
ORDER BY DESCRIPTION;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99)]

C.7. List all details about all parts. Order the output by part number within warehouse. (That is, order the output by warehouse and then by part number.)

In [53]:
%%sql
SELECT *
FROM PART
ORDER BY WAREHOUSE, PART_NUM;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595)]

C.8. List the part number, part description, and on-hand value of each part whose number of units on hand is more than the average number of units on hand for all parts. (Hint: Use a subquery.)

In [54]:
%%sql
SELECT PART_NUM, DESCRIPTION, ON_HAND
FROM PART
WHERE ON_HAND >
(SELECT AVG(ON_HAND)
FROM PART);

 * sqlite://
Done.

[('AT94', 'Iron', 50),
 ('BV06', 'Home Gym', 45),
 ('CD52', 'Microwave Oven', 32),
 ('FD21', 'Stand Mixer', 22)]

C.9. List the sum of the balances of all customers for each sales rep. Order and group the results by sales rep number.

In [55]:
%%sql
SELECT REP_NUM, SUM(BALANCE)
FROM CUSTOMER 
GROUP BY REP_NUM
ORDER BY REP_NUM;

 * sqlite://
Done.

[('20', 27533), ('35', 8815.75), ('65', 11303)]

C.10. List the sum of the balances of all customers for each sales rep, but restrict the output to those sales reps for which the sum is more than $10,000. Order the results by sales rep number.

In [56]:
%%sql
SELECT REP_NUM, SUM(BALANCE)
FROM CUSTOMER
GROUP BY REP_NUM
HAVING SUM(BALANCE) > 10000
ORDER BY REP_NUM;

 * sqlite://
Done.

[('20', 27533), ('65', 11303)]

C.11. List the part number of any part with an unknown description.

In [57]:
%%sql
SELECT PART_NUM
FROM PART
WHERE DESCRIPTION IS NULL;

 * sqlite://
Done.

[]

D.1. For each order, list the order number and order date along with the number and name of the customer that placed the order.

In [58]:
%%sql
SELECT ORDER_NUM, ORDER_DATE, ORDERS.CUSTOMER_NUM, CUSTOMER_NAME
FROM ORDERS, CUSTOMER
WHERE ORDERS.CUSTOMER_NUM = CUSTOMER.CUSTOMER_NUM;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

D.2. For each order placed on October 23, 2010, list the order number along with the number and name of the customer that placed the order.

In [59]:
%%sql
SELECT ORDER_NUM, ORDERS.CUSTOMER_NUM, CUSTOMER_NAME
FROM ORDERS, CUSTOMER
WHERE ORDERS.CUSTOMER_NUM = CUSTOMER.CUSTOMER_NUM
AND ORDER_DATE = '23-OCT-2010';

 * sqlite://
Done.

[('21617', '608', "Johnson's Department Store"),
 ('21619', '148', "Al's Appliance and Sport"),
 ('21623', '608', "Johnson's Department Store")]

D.3. For each order, list the order number, order date, part number, number of units ordered, and quoted price for each order line that makes up the order.

In [60]:
%%sql
SELECT ORDERS.ORDER_NUM, ORDER_DATE, PART_NUM, NUM_ORDERED, QUOTED_PRICE
FROM ORDERS, ORDER_LINE
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM;

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 11, 21.95),
 ('21610', '20-OCT-2010', 'DR93', 1, 495),
 ('21610', '20-OCT-2010', 'DW11', 1, 399.99),
 ('21613', '21-OCT-2010', 'KL62', 4, 329.95),
 ('21614', '21-OCT-2010', 'KT03', 2, 595),
 ('21617', '23-OCT-2010', 'BV06', 2, 794.95),
 ('21617', '23-OCT-2010', 'CD52', 4, 150),
 ('21619', '23-OCT-2010', 'DR93', 1, 495),
 ('21623', '23-OCT-2010', 'KV29', 2, 1290)]

D.4. Use the IN operator to find the number and name of each customer that placed an order on October 23, 2010.

In [61]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE CUSTOMER_NUM IN
(SELECT CUSTOMER_NUM
FROM ORDERS 
WHERE ORDER_DATE = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

D.5. Repeat Exercise 4, but this time use the EXISTS operator in your answer.

In [62]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE EXISTS
(SELECT *
FROM ORDERS
WHERE ORDERS.CUSTOMER_NUM = CUSTOMER.CUSTOMER_NUM
AND ORDER_DATE = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

D.6. Find the number and name of each customer that did not place an order on October 23, 2010.

In [63]:
%%sql
SELECT CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
WHERE CUSTOMER_NUM NOT IN
(SELECT CUSTOMER_NUM
FROM ORDERS 
WHERE ORDER_DATE = '23-OCT-2010');

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('524', "Kline's"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons"),
 ('842', 'All Season')]

D.7. For each order, list the order number, order date, part number, part description, and item class for each part that makes up the order.

In [64]:
%%sql
SELECT ORDERS.ORDER_NUM, ORDER_DATE, PART.PART_NUM, DESCRIPTION, CLASS
FROM ORDERS, ORDER_LINE, PART
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND ORDER_LINE.PART_NUM = PART.PART_NUM;

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

D.8. Repeat Exercise 7, but this time order the rows by item class and then by order number.

In [65]:
%%sql
SELECT ORDERS.ORDER_NUM, ORDER_DATE, PART.PART_NUM, DESCRIPTION, CLASS
FROM ORDERS, ORDER_LINE, PART
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND ORDER_LINE.PART_NUM = PART.PART_NUM
ORDER BY CLASS, ORDERS.ORDER_NUM;

 * sqlite://
Done.

[('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

D.9. Use a subquery to find the rep number, last name, and first name of each sales rep who represents at least one customer with a credit limit of $10,000. List each sales rep only once in the results.

In [66]:
%%sql
SELECT REP_NUM, LAST_NAME, FIRST_NAME
FROM REP
WHERE REP_NUM IN 
(SELECT REP_NUM
FROM CUSTOMER
WHERE CREDIT_LIMIT = 10000);

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

D.10. Repeat Exercise 9, but this time do not use a subquery.

In [67]:
%%sql
SELECT DISTINCT REP.REP_NUM, LAST_NAME, FIRST_NAME
FROM REP, CUSTOMER
WHERE REP.REP_NUM = CUSTOMER.REP_NUM
AND CREDIT_LIMIT = 10000;

 * sqlite://
Done.

[('35', 'Hull', 'Richard'), ('65', 'Perez', 'Juan')]

D.11. Find the number and name of each customer that currently has an order on file for a
Gas Range.

In [68]:
%%sql
SELECT CUSTOMER.CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER, ORDERS, ORDER_LINE, PART
WHERE CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
AND ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND ORDER_LINE.PART_NUM = PART.PART_NUM
AND DESCRIPTION = 'Gas Range';

 * sqlite://
Done.

[('356', "Ferguson's"), ('148', "Al's Appliance and Sport")]

In [69]:
%%sql
SELECT CUSTOMER.CUSTOMER_NUM, CUSTOMER_NAME
FROM CUSTOMER
JOIN ORDERS ON CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
JOIN ORDER_LINE ON ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
JOIN PART ON ORDER_LINE.PART_NUM = PART.PART_NUM
WHERE DESCRIPTION = 'Gas Range';

 * sqlite://
Done.

[('356', "Ferguson's"), ('148', "Al's Appliance and Sport")]

D.12. List the part number, part description, and item class for each pair of parts that are in the same item class. (For example, one such pair would be part AT94 and part FD21, because the item class for both parts is HW.)

In [70]:
%%sql
SELECT F.PART_NUM, F.DESCRIPTION, S.PART_NUM, S.DESCRIPTION, F.CLASS
FROM PART F, PART S
WHERE F.CLASS = S.CLASS
AND F.PART_NUM < S.PART_NUM
ORDER BY F.CLASS, F.PART_NUM, S.PART_NUM;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 'DR93', 'Gas Range', 'AP'),
 ('CD52', 'Microwave Oven', 'DW11', 'Washer', 'AP'),
 ('CD52', 'Microwave Oven', 'KL62', 'Dryer', 'AP'),
 ('CD52', 'Microwave Oven', 'KT03', 'Dishwasher', 'AP'),
 ('DR93', 'Gas Range', 'DW11', 'Washer', 'AP'),
 ('DR93', 'Gas Range', 'KL62', 'Dryer', 'AP'),
 ('DR93', 'Gas Range', 'KT03', 'Dishwasher', 'AP'),
 ('DW11', 'Washer', 'KL62', 'Dryer', 'AP'),
 ('DW11', 'Washer', 'KT03', 'Dishwasher', 'AP'),
 ('KL62', 'Dryer', 'KT03', 'Dishwasher', 'AP'),
 ('AT94', 'Iron', 'DL71', 'Cordless Drill', 'HW'),
 ('AT94', 'Iron', 'FD21', 'Stand Mixer', 'HW'),
 ('DL71', 'Cordless Drill', 'FD21', 'Stand Mixer', 'HW'),
 ('BV06', 'Home Gym', 'KV29', 'Treadmill', 'SG')]

D.13. List the order number and order date for each order placed by the customer named Johnsons Department Store. (Hint: To enter an apostrophe (single quotation mark) within a string of characters, type two single quotation marks.)

In [71]:
%%sql
SELECT ORDERS.ORDER_NUM, ORDER_DATE
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
AND CUSTOMER_NAME = 'Johnson''s Department Store';

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

D.14. List the order number and order date for each order that contains an order line for an Iron.

In [72]:
%%sql
SELECT ORDERS.ORDER_NUM, ORDER_DATE
FROM ORDERS, ORDER_LINE, PART
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND ORDER_LINE.PART_NUM = PART.PART_NUM
AND DESCRIPTION = 'Iron';

 * sqlite://
Done.

[('21608', '20-OCT-2010')]

D.15. List the order number and order date for each order that either was placed by Johnsons Department Store or that contains an order line for a Gas Range.

In [73]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
AND CUSTOMER_NAME = 'Johnson''s Department Store'
UNION
SELECT ORDERS.ORDER_NUM, ORDER_DATE
FROM ORDERS, ORDER_LINE, PART
WHERE ORDERS.ORDER_NUM = ORDER_LINE.ORDER_NUM
AND ORDER_LINE.PART_NUM = PART.PART_NUM
AND DESCRIPTION = 'Gas Range';

 * sqlite://
Done.

[('21610', '20-OCT-2010'),
 ('21617', '23-OCT-2010'),
 ('21619', '23-OCT-2010'),
 ('21623', '23-OCT-2010')]

D.16. List the order number and order date for each order that was placed by Johnsons Department Store and that contains an order line for a Gas Range.

In [74]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
AND CUSTOMER_NAME = 'Johnson''s Department Store'
AND ORDER_NUM IN
(SELECT ORDER_NUM
FROM ORDER_LINE, PART
WHERE ORDER_LINE.PART_NUM = PART.PART_NUM
AND DESCRIPTION = 'Gas Range');

 * sqlite://
Done.

[]

D.17. List the order number and order date for each order that was placed by Johnsons Department Store but that does not contain an order line for a Gas Range.

In [75]:
%%sql
SELECT ORDER_NUM, ORDER_DATE
FROM CUSTOMER, ORDERS
WHERE CUSTOMER.CUSTOMER_NUM = ORDERS.CUSTOMER_NUM
AND CUSTOMER_NAME = 'Johnson''s Department Store'
AND ORDER_NUM NOT IN
(SELECT ORDER_NUM
FROM ORDER_LINE, PART
WHERE ORDER_LINE.PART_NUM = PART.PART_NUM
AND DESCRIPTION = 'Gas Range');

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

D.18. For each part, list the part number, description, units on hand, order number, and number of units ordered. All parts should be included in the results. For those parts that are currently not on order, the order number and number of units ordered should be left blank (None/NULL/NA). Order the results by part number.

In [76]:
%%sql
SELECT PART.PART_NUM, DESCRIPTION, ON_HAND, ORDER_NUM, NUM_ORDERED
FROM PART
LEFT JOIN ORDER_LINE
ON PART.PART_NUM = ORDER_LINE.PART_NUM
ORDER BY PART.PART_NUM;

 * sqlite://
Done.

[('AT94', 'Iron', 50, '21608', 11),
 ('BV06', 'Home Gym', 45, '21617', 2),
 ('CD52', 'Microwave Oven', 32, '21617', 4),
 ('DL71', 'Cordless Drill', 21, None, None),
 ('DR93', 'Gas Range', 8, '21610', 1),
 ('DR93', 'Gas Range', 8, '21619', 1),
 ('DW11', 'Washer', 12, '21610', 1),
 ('FD21', 'Stand Mixer', 22, None, None),
 ('KL62', 'Dryer', 12, '21613', 4),
 ('KT03', 'Dishwasher', 8, '21614', 2),
 ('KV29', 'Treadmill', 9, '21623', 2)]

THE END.